events/ALERT.KESI.IssueUpdate.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
<s:Header></s:Header>
<s:Body>
<wsnt:Notify>
<wsnt:NotificationMessage>
<wsnt:Topic></wsnt:Topic>
<wsnt:ProducerReference>
<wsa:Address>http://www.alert-project.eu/kesi</wsa:Address>
</wsnt:ProducerReference>
<wsnt:Message>
<ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
<ns1:head>
<ns1:sender>KESI</ns1:sender>
<ns1:timestamp>10000</ns1:timestamp>
<ns1:sequencenumber>1</ns1:sequencenumber>
</ns1:head>
<ns1:payload>
<ns1:meta>
<ns1:startTime>10010</ns1:startTime>
<ns1:endTime>10010</ns1:endTime>
<!-- name of event -->
<ns1:eventName>ALERT.KESI.IssueUpdate</ns1:eventName>
<ns1:eventId>5748</ns1:eventId>
<ns1:eventType>request</ns1:eventType>
</ns1:meta>
<ns1:eventData>
<s:issue>
<!-- issue id -->
<s:issueId>184671</s:issueId>
<!-- issue status (Assigned, Open, Verified, Resolved, Closed) -->
<!--<s:issueStatus>Assigned</s:issueStatus>-->
<!-- issue resolution (Duplicate, Fixed, Invalid, ThirdParty, WontFix, WorksForMe, Later, Remind) -->

<s:issueActivity>
<s:activityId></s:activityId>
<s:activityWho>lcanas@libresoft.es</s:activityWho>
<s:activityWhen>2011-11-10 15:58:19</s:activityWhen>
<!--<s:activityWRA>-->
<s:activityWhat>Status</s:activityWhat>
<s:activityRemoved>New</s:activityRemoved>
<s:activityAdded>Assigned</s:activityAdded>
<!--</s:activityWRA>-->
</s:issueActivity>

<s:issueTracker>
<s:issueTrackerId>241</s:issueTrackerId>
<s:issueTrackerType>bugzilla</s:issueTrackerType>
<s:issueTrackerURL>https://bugs.kde.org/</s:issueTrackerURL>
</s:issueTracker>

</s:issue>
</ns1:eventData>
</ns1:payload>
</ns1:event>
</wsnt:Message>
</wsnt:NotificationMessage>
</wsnt:Notify>
</s:Body>
</s:Envelope>
